stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  html += "function removeNetwork(idx, ssid) {";
  html += "  const msgEl = document.getElementById('networkMsg');";
  html += "  if (!confirm('Remove network \"' + ssid + '\"?')) return;";
  html += "  const formData = new URLSearchParams();";
  html += "  formData.append('index', idx);";
  html += "  fetch('/removeNetwork', { method: 'POST', headers: {'Content-Type':'application/x-www-form-urlencoded'}, body: formData.toString() })";
  html += "    .then(r => r.text())";
  html += "    .then(msg => { msgEl.textContent = msg; msgEl.style.color = msg.includes('removed') ? 'green' : 'red'; })";
  html += "    .catch(e => { msgEl.textContent = 'Error: ' + e; msgEl.style.color = 'red'; });";
  html += "}";
  
  html += "window.onload = loadSettings;";
  html += "</script>";
  html += "</body></html>";
  
  Serial.println("Settings page HTML generated, size: " + String(html.length()) + " bytes");
  request->send(200, "text/html", html);
  Serial.println("Settings page sent successfully");
}

// Get current settings as JSON
void handleGetSettings(AsyncWebServerRequest *request) {
  Serial.println("=== GET SETTINGS REQUEST ===");
  
  JsonDocument doc;
  
  // WiFi settings
  doc["wifi_mode"] = espData.wifiMode;
  doc["ap_ssid"]   = espData.apCfg.ssid;
  doc["ap_pass"]   = espData.apCfg.password;
  doc["ap_ch"]     = espData.apCfg.channel;
  doc["ap_ip3"]    = espData.apCfg.ips[3];
  JsonArray networks = doc.createNestedArray("sta_networks");
  for (int i = 0; i < espData.staCfg.count; i++) {
    JsonObject net = networks.createNestedObject();
    net["ssid"] = espData.staCfg.ssids[i];
    net["pass"] = espData.staCfg.passwords[i];
  }

  // Steering settings
  doc["kp"] = espData.steer.gainP;
  doc["highPWM"] = espData.steer.highPWM;
  doc["lowPWM"] = espData.steer.lowPWM;
  doc["minPWM"] = espData.steer.minPWM;
  doc["countsPerDeg"] = espData.steer.countsPerDeg;
  doc["wasOffset"] = espData.steer.steerOffset;
  doc["pidInputFilt"] = espData.steer.pidInputFilt;
  doc["pidOutputFilt"] = espData.steer.pidOutputFilt;
  doc["useADS"] = espData.steer.useADS;
  
  // System settings
  doc["gpsSource"] = espData.gps.externalGPS ? 1 : 0;
  doc["wasSource"] = espData.steer.wirelessWAS ? 1 : 0;
  doc["ledBrightness"] = espData.program.ledBrht;
  doc["adsAddress"] = "0x48";
  doc["pandaMode"] = espData.gps.ntripPandaMode ? 1 : 0;
  doc["flipPitchRoll"] = espData.gps.flipPitchRoll ? 1 : 0;
  doc["invertRoll"] = espData.gps.invertRoll ? 1 : 0;
  doc["disableHeading"] = espData.gps.disableHeading ? 1 : 0;
  
  String response;
  serializeJson(doc, response);
  request->send(200, "application/json", response);
  Serial.println("Settings JSON sent successfully");
}

// Save settings from JSON POST
void handleSaveSettings(AsyncWebServerRequest *request) {
  Serial.println("=== SAVE SETTINGS REQUEST ===");
  bool doReboot = false;

  // WiFi / AP settings (require reboot)
  if (request->hasParam("ap_ssid", true)) {
    String v = request->getParam("ap_ssid", true)->value();
    if (v.length() > 0 && v.length() < 64) {
      espData.preferences.putString("ap_ssid", v);
      doReboot = true;
    }
  }
  if (request->hasParam("ap_pass", true)) {
    String v = request->getParam("ap_pass", true)->value();
    if (v.length() > 0 && v.length() < 64) {
      espData.preferences.putString("ap_pass", v);
      doReboot = true;
    }
  }
  if (request->hasParam("ap_ip3", true)) {
    int ip3 = request->getParam("ap_ip3", true)->value().toInt();
    if (ip3 >= 1 && ip3 <= 254) {
      espData.preferences.putUChar("ap_ip3", ip3);
      doReboot = true;
    }
  }
  if (request->hasParam("wifi_mode", true)) {
    int mode = request->getParam("wifi_mode", true)->value().toInt();
    if (mode >= 0 && mode <= 2) {
      espData.preferences.putInt("wifi_mode", mode);
      doReboot = true;
    }
  }

  // Steering settings
  if (request->hasParam("kp", true)) {
    espData.steer.gainP = request->getParam("kp", true)->value().toFloat();
  }
  if (request->hasParam("highPWM", true)) {
    espData.steer.highPWM = request->getParam("highPWM", true)->value().toInt();
  }
  if (request->hasParam("lowPWM", true)) {
    espData.steer.lowPWM = request->getParam("lowPWM", true)->value().toInt();
  }
  if (request->hasParam("minPWM", true)) {
    espData.steer.minPWM = request->getParam("minPWM", true)->value().toInt();
  }
  if (request->hasParam("countsPerDeg", true)) {
    espData.steer.countsPerDeg = request->getParam("countsPerDeg", true)->value().toFloat();
  }
  if (request->hasParam("wasOffset", true)) {
    espData.steer.steerOffset = request->getParam("wasOffset", true)->value().toInt();
  }
  }
  if (request->hasParam("pidInputFilt", true)) {
    float oldValue = espData.steer.pidInputFilt;
    espData.steer.pidInputFilt = request->getParam("pidInputFilt", true)->value().toFloat();
    Serial.println("  PID Input Filter: " + String(oldValue) + " -> " + String(espData.steer.pidInputFilt));
  }
  if (request->hasParam("pidOutputFilt", true)) {
    espData.steer.pidOutputFilt = request->getParam("pidOutputFilt", true)->value().toFloat();
  }
  if (request->hasParam("useADS", true)) {
    espData.steer.useADS = request->getParam("useADS", true)->value().toInt();
  }
  
  // System settings
  if (request->hasParam("gpsSource", true)) {
    espData.gps.externalGPS = request->getParam("gpsSource", true)->value().toInt();
  }
  if (request->hasParam("wasSource", true)) {
    espData.steer.wirelessWAS = request->getParam("wasSource", true)->value().toInt();
  }
  if (request->hasParam("ledBrightness", true)) {
    espData.program.ledBrht = request->getParam("ledBrightness", true)->value().toInt();
    myLED.updateBrightness();
  }
  if (request->hasParam("pandaMode", true)) {
    espData.gps.ntripPandaMode = request->getParam("pandaMode", true)->value().toInt();
  }
  if (request->hasParam("flipPitchRoll", true)) {
    espData.gps.flipPitchRoll = request->getParam("flipPitchRoll", true)->value().toInt();
  }
  if (request->hasParam("invertRoll", true)) {
    espData.gps.invertRoll = request->getParam("invertRoll", true)->value().toInt();
  }
  if (request->hasParam("disableHeading", true)) {
    espData.gps.disableHeading = request->getParam("disableHeading", true)->value().toInt();
  }
  
