stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  bool saveResult = espData.saveConfig();
  if (saveResult) {
    String msg = doReboot ? "Settings saved. Rebooting..." : "Settings saved successfully!";
    request->send(200, "text/plain", msg);
    if (doReboot) { delay(500); ESP.restart(); }
  } else {
    request->send(500, "text/plain", "Failed to save settings to memory");
  }
  Serial.println("=== SAVE SETTINGS COMPLETE ===");
}

void handleAddNetwork(AsyncWebServerRequest *request) {
  if (!request->hasParam("ssid", true)) {
    request->send(400, "text/plain", "Missing ssid");
    return;
  }
  String ssid = request->getParam("ssid", true)->value();
  String pass = request->hasParam("pass", true) ? request->getParam("pass", true)->value() : "";
  ssid.trim();
  if (ssid.length() == 0 || ssid.length() >= 64) {
    request->send(400, "text/plain", "SSID must be 1–63 characters");
    return;
  }
  if (pass.length() >= 64) {
    request->send(400, "text/plain", "Password must be fewer than 64 characters");
    return;
  }
  int count = espData.preferences.getInt("sta_count", 0);
  if (count >= ESPdata::STAConfig::MAX_NETWORKS) {
    request->send(400, "text/plain", "Maximum number of networks reached");
    return;
  }
  for (int i = 0; i < count; i++) {
    String keySSID = "sta_ssid_" + String(i);
    if (espData.preferences.getString(keySSID.c_str(), "") == ssid) {
      request->send(400, "text/plain", "Network already exists");
      return;
    }
  }
  String keySSID = "sta_ssid_" + String(count);
  String keyPass = "sta_pass_" + String(count);
  espData.preferences.putString(keySSID.c_str(), ssid);
  espData.preferences.putString(keyPass.c_str(), pass);
  espData.preferences.putInt("sta_count", count + 1);
  request->send(200, "text/plain", "Network added. Rebooting...");
  delay(500);
  ESP.restart();
}

void handleRemoveNetwork(AsyncWebServerRequest *request) {
  if (!request->hasParam("index", true)) {
    request->send(400, "text/plain", "Missing index");
    return;
  }
  int idx   = request->getParam("index", true)->value().toInt();
  int count = espData.preferences.getInt("sta_count", 0);
  if (idx < 0 || idx >= count) {
    request->send(400, "text/plain", "Invalid index");
    return;
  }
  for (int i = idx; i < count - 1; i++) {
    String keySSID_src = "sta_ssid_" + String(i + 1);
    String keyPass_src = "sta_pass_" + String(i + 1);
    String keySSID_dst = "sta_ssid_" + String(i);
    String keyPass_dst = "sta_pass_" + String(i);
    espData.preferences.putString(keySSID_dst.c_str(),
        espData.preferences.getString(keySSID_src.c_str(), ""));
    espData.preferences.putString(keyPass_dst.c_str(),
        espData.preferences.getString(keyPass_src.c_str(), ""));
  }
  String keySSID_last = "sta_ssid_" + String(count - 1);
  String keyPass_last = "sta_pass_" + String(count - 1);
  espData.preferences.remove(keySSID_last.c_str());
  espData.preferences.remove(keyPass_last.c_str());
  espData.preferences.putInt("sta_count", count - 1);
  request->send(200, "text/plain", "Network removed. Rebooting...");
  delay(500);
  ESP.restart();
}

// File download handler
// void handleFileDownload(AsyncWebServerRequest *request) {
//   if (request->hasParam("filename")) {
//     String filename = request->getParam("filename")->value();
//     if (LittleFS.exists("/" + filename)) {
//       request->send(LittleFS, "/" + filename, "application/octet-stream");
//     } else {
//       request->send(404, "text/plain", "File not found");
//     }
//   } else {
//     request->send(400, "text/plain", "Filename not provided");
//   }
// }

// File upload handler
void handleFileUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
  if (!index) {
    // Open file for writing
    Serial.printf("UploadStart: %s\n", filename.c_str());
    request->_tempFile = LittleFS.open("/" + filename, "w");
  }
  if (len) {
    // Write the file content
    request->_tempFile.write(data, len);
  }
  if (final) {
    // Close the file
    request->_tempFile.close();
    Serial.printf("UploadEnd: %s, %u B\n", filename.c_str(), index + len);
    request->send(200, "text/plain", "File Uploaded");
  }
}


void handleToggleAPMode(AsyncWebServerRequest *request) {
  static bool apModeState = false;
  apModeState = !apModeState;
  espData.wifi.apMode = apModeState ? 1 : 0;
  Serial.printf("AP Mode State: %s\n", apModeState ? "ON" : "OFF");
  request->send(200, "text/plain", apModeState ? "AP_Mode is ON" : "AP_Mode is OFF");
}



#pragma endregion

#pragma region Buttons
/**
 * @brief Interrupt service routine for handling steering switch activation
 * 
 * @details This ISR is triggered when the steering switch is pressed. It implements
 *          debouncing logic with a 100ms minimum interval between triggers.
 *          Sets the steerSwitch flag and updates the last trigger timestamp.
 *          Must be declared with IRAM_ATTR for interrupt handling on ESP32.
 * 
 * @note This function runs in interrupt context - keep execution time minimal
 * @see handleWorkSwitch(), buttonSetup()
 */
void IRAM_ATTR handleSteerSwitch() {
  unsigned long currentTime = millis();
  if (currentTime - espData.steer.steerSwitchLastTime > 100) {
      espData.steer.steerSwitch = true; // Set the flag
      espData.steer.steerSwitchLastTime = currentTime; // Update the debounce timestamp
    }
}

/**
 * @brief Interrupt service routine for handling work switch activation
 * 
 * @details This ISR is triggered when the work switch is pressed. It implements
 *          debouncing logic with a 100ms minimum interval between triggers.
 *          Sets the workSwitch flag and updates the last trigger timestamp.
 *          Must be declared with IRAM_ATTR for interrupt handling on ESP32.
 * 
 * @note This function runs in interrupt context - keep execution time minimal
 * @see handleSteerSwitch(), buttonSetup()
 */
void IRAM_ATTR handleWorkSwitch() {
  unsigned long currentTime = millis();
  if (currentTime - espData.switches.workSwitchLastTime > 100) {
      espData.switches.workSwitch = true; // Set the flag
      espData.switches.workSwitchLastTime = currentTime; // Update the debounce timestamp
  }
}

/**
 * @brief Configures GPIO pins and interrupt handlers for physical switches
 * 
 * @details This function initializes the hardware button interface by:
 *          - Setting steering and work switch pins as INPUT_PULLUP
 *          - Attaching interrupt handlers for FALLING edge detection
 *          - Enabling hardware debouncing through interrupt configuration
 * 
 * @note Called once during system initialization in setup()
 * @see handleSteerSwitch(), handleWorkSwitch()
 */
void buttonSetup(){
  // Set up the GPIO pins for the buttons
  pinMode(espData.pins.STEER_SWITCH_PIN, INPUT_PULLUP);
  pinMode(espData.pins.WORK_SWITCH_PIN, INPUT_PULLUP);

