stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  // Attach interrupts to the buttons
  attachInterrupt(digitalPinToInterrupt(espData.pins.STEER_SWITCH_PIN), handleSteerSwitch, FALLING);
  attachInterrupt(digitalPinToInterrupt(espData.pins.WORK_SWITCH_PIN), handleWorkSwitch, FALLING);
}
#pragma endregion


/**
 * @brief Handles runtime serial commands for system control and diagnostics
 * 
 * @details This function processes serial input commands for remote system management:
 *          - "help" - Display available commands and usage
 *          - "status" - Show current system status and debug information
 *          - "reboot" - Perform immediate system restart
 *          - "recovery" - Set recovery mode flag and restart
 *          - "normal" - Clear recovery mode flag and restart
 * 
 *          Uses a static input buffer for command line parsing with newline termination.
 *          Commands are case-insensitive and provide immediate feedback.
 * 
 * @note Called continuously in main loop() for real-time command processing
 * @see setup(), loop()
 */
void handleSerialCommands() {
  static String inputBuffer = "";
  
  while (Serial.available()) {
    char c = Serial.read();
    
    if (c == '\n' || c == '\r') {
      if (inputBuffer.length() > 0) {
        inputBuffer.trim();
        inputBuffer.toLowerCase();
        
        Serial.println(""); // New line after command
        
        if (inputBuffer == "help" || inputBuffer == "?") {
          Serial.println("=== Available Serial Commands ===");
          Serial.println("help or ?         - Show this help");
          Serial.println("reboot            - Restart ESP32");
          Serial.println("recovery          - Reboot into recovery mode");
          Serial.println("normal            - Reboot into normal mode");
          Serial.println("status            - Show system status");
          Serial.println("config            - Show configuration");
          Serial.println("gps raw           - Set GPS to raw NMEA forwarding mode");
          Serial.println("gps panda         - Set GPS to PANDA generation mode");
          Serial.println("====================================");
          
        } else if (inputBuffer == "reboot") {
          Serial.println("SERIAL COMMAND: Rebooting ESP32...");
          delay(100);
          ESP.restart();
          
        } else if (inputBuffer == "recovery") {
          Serial.println("SERIAL COMMAND: Setting recovery mode and rebooting...");
          espData.program.state = 0; // Force recovery state
          espData.updateRTCBeforeReboot(0); // Update RTC before reboot
          espData.saveConfig();
          delay(100);
          ESP.restart();
          
        } else if (inputBuffer == "normal") {
          Serial.println("SERIAL COMMAND: Setting normal mode and rebooting...");
          espData.program.state = 1; // Force normal state
          espData.updateRTCBeforeReboot(1); // Update RTC before reboot
          espData.saveConfig();
          delay(100);
          ESP.restart();
          
        } else if (inputBuffer == "status") {
          Serial.println("=== System Status ===");
          Serial.println("Program: " + String(NAME));
          Serial.println("Boot Mode: " + String(espData.program.state == 1 ? "Normal" : "Recovery"));
          Serial.println("NVS Boot Count: " + String(espData.program.bootcount));
          Serial.println("Software Boots (since power cycle): " + String(espData.getSoftwareBootCount()));
          Serial.println("Uptime: " + String(millis()/1000) + " seconds");
          Serial.println("Free Heap: " + String(ESP.getFreeHeap()) + " bytes");
          Serial.println("WiFi State: " + String(espData.wifi.state));
          Serial.println("GPS Fix: " + String(espData.gps.fixQuality));
          Serial.println("====================");
          
        } else if (inputBuffer == "config") {
          Serial.println("=== Configuration ===");
          Serial.println("IP: " + String(espData.wifi.ips[0]) + "." + String(espData.wifi.ips[1]) + "." + String(espData.wifi.ips[2]) + "." + String(espData.wifi.ips[3]));
          Serial.println("GPS Source: " + String(espData.gps.externalGPS ? "Wireless" : "On-board"));
          Serial.println("GPS Output: " + String(espData.gps.ntripPandaMode ? "PANDA Generation" : "Raw NMEA Forwarding"));
          Serial.println("WAS Source: " + String(espData.steer.wirelessWAS ? "Wireless" : "Wired"));
          Serial.println("Use ADS: " + String(espData.steer.useADS ? "Yes" : "No"));
          Serial.println("LED Brightness: " + String(espData.program.ledBrht));
          Serial.println("PID Kp: " + String(espData.steer.gainP));
          Serial.println("====================");
          
        } else if (inputBuffer == "gps raw") {
          Serial.println("SERIAL COMMAND: Setting GPS to raw NMEA forwarding mode");
          espData.gps.ntripPandaMode = false;
          espData.saveConfig();
          Serial.println("GPS output set to: Raw NMEA Forwarding");
          Serial.println("GPS GGA/VTG sentences will be forwarded as-is via UDP");
          
        } else if (inputBuffer == "gps panda") {
          Serial.println("SERIAL COMMAND: Setting GPS to PANDA generation mode");
          espData.gps.ntripPandaMode = true;
          espData.saveConfig();
          Serial.println("GPS output set to: PANDA Generation");
          Serial.println("GPS GGA/VTG sentences will be parsed to generate PANDA messages");
          
        } else if (inputBuffer.length() > 0) {
          Serial.println("Unknown command: " + inputBuffer);
          Serial.println("Type 'help' for available commands");
        }
        
        inputBuffer = "";
        Serial.print("> "); // Command prompt
      }
    } else if (c >= 32 && c <= 126) { // Printable characters only
      inputBuffer += c;
      Serial.print(c); // Echo character
    }
  }
}

/**
 * @brief Outputs basic system debug information to serial console
 * 
 * @details This function prints essential system status to the serial interface:
 *          - Current timestamp (milliseconds since boot)
 *          - Program name and current operational state
 *          - Steering angle and target steering values
 *          - WiFi connection status and assigned IP address
 * 
 *          Uses tab-separated format for easy parsing and debugging.
 *          Called periodically for monitoring system operation.
 * 
 * @note Less detailed than status command output, optimized for frequent calls
 * @see handleSerialCommands()
 */
void debugPrint(){
  webSerial("Timestamp: " + String(millis()) + "\n");
  webSerial("\tprogName: " + String(NAME));
  webSerial("\tprogState: " + String(espData.program.state));
  webSerial("\tconfRes: " + String(espData.program.confRes));
  webSerial("\twifiRes: " + String(espData.wifi.state));
  webSerial("\tgpsFix: " + String(espData.gps.fixQualityInt));
  webSerial("\tip: " + String(espData.wifi.ips[0]) + "." + 
                     String(espData.wifi.ips[1]) + "." + 
                     String(espData.wifi.ips[2]) + "." + 
                     String(espData.wifi.ips[3]) + "\n");
  // webSerial("\timu roll: " + String(espData.gps.imuRoll) + 
  //           "\timu pitch: " + String(espData.gps.imuPitch) + 
  //           "\timu yaw: " + String(espData.gps.imuHeading) + "\n");
}

/**
 * @brief Write startup log entry to file system
 * @param logEntry The log entry to write
 * @param isNewBoot True if this is a new boot session, false for additional entries
 */
void writeStartupLog(String logEntry, bool isNewBoot = false) {
  File logFile = LittleFS.open("/startup.log", isNewBoot ? "w" : "a");
  if (logFile) {
    if (isNewBoot) {
      // Add header for new boot session
      logFile.println("=== ESP32-AIO Startup Log ===");
      logFile.println("Firmware: " + String(NAME) + " v" + String(VERSION));
      logFile.println("Boot Time: " + String(millis()) + "ms since power-on");
      logFile.println("Reset Reason: " + String(esp_reset_reason()));
      logFile.println("Free Heap: " + String(ESP.getFreeHeap()) + " bytes");
      logFile.println("Chip Model: " + String(ESP.getChipModel()));
      logFile.println("CPU Freq: " + String(ESP.getCpuFreqMHz()) + " MHz");
      logFile.println("Flash Size: " + String(ESP.getFlashChipSize()) + " bytes");
      logFile.println("MAC Address: " + WiFi.macAddress());
      logFile.println("Boot Count: " + String(espData.program.bootcount));
      logFile.println("================================");
    }
    logFile.println(String(millis()) + "ms: " + logEntry);
    logFile.close();
    Serial.println("Startup Log: " + logEntry);
  } else {
    Serial.println("ERROR: Could not write to startup log: " + logEntry);
  }
}

/**
 * @brief Log startup state information
 * @param stage The boot stage name
 * @param status The status or result
 * @param details Additional details (optional)
 */
void logStartupState(const char* stage, const char* status, const char* details = "") {
  String logEntry = String(stage) + " -> " + String(status);
  if (strlen(details) > 0) {
    logEntry += " (" + String(details) + ")";
  }
  writeStartupLog(logEntry);
}

#pragma region Setup and Loop
/**
 * @brief Initializes the system in recovery mode with AP WiFi and basic web interface
 * 
 * @details Recovery mode provides emergency access when normal boot fails:
 *          - Creates WiFi Access Point "ESP32_AIO_RECOVERY" with password "recovery123"
 *          - Sets up minimal web server on 192.168.4.1 for configuration access
 *          - Loads recovery-specific debug variables for system diagnostics
 *          - Provides file system access for configuration recovery
 *          - Enables serial command interface for remote management
 * 
 *          This mode bypasses normal hardware initialization and network connection,
 *          allowing system recovery when configuration is corrupted or unreachable.
 * 
 * @note Only essential services are started to minimize resource usage
 * @see normalboot(), setup()
 */
void recoveryBoot() {
  Serial.println("=== ENTERING RECOVERY MODE ===");
  logStartupState("Boot Mode", "Recovery Mode", "Normal boot failed");
  
