stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
    for (const auto& var : debugVars) {
      array.add(var);
    }
    
    String jsonResponse;
    serializeJson(doc, jsonResponse);
    request->send(200, "application/json", jsonResponse);
  });
  
  // Factory reset endpoint
  // server.on("/factoryReset", HTTP_GET, [](AsyncWebServerRequest *request) {
  //   Serial.println("Factory reset requested");
  //   request->send(200, "text/plain", "Factory reset initiated. Device will reboot...");
  //   delay(1000);
  //   LittleFS.format();
  //   ESP.restart();
  // });
  
  // Force normal boot endpoint
  server.on("/forceNormalBoot", HTTP_GET, [](AsyncWebServerRequest *request) {
    Serial.println("Force normal boot requested");
    espData.program.state = 1; // Set to normal boot state
    espData.program.bootcount = 0; // Reset boot count
    espData.saveConfig();
    request->send(200, "text/plain", "Normal boot forced. Device will reboot...");
    delay(1000);
    ESP.restart();
  });
  
  // Recovery-specific debug endpoint to avoid conflicts with normal mode
  server.on("/getRecoveryDebug", HTTP_GET, [](AsyncWebServerRequest *request) {
    updateRecoveryDebugVars();
    JsonDocument doc;
    JsonArray array = doc.to<JsonArray>();
    
    for (const auto& var : debugVars) {
      array.add(var);
    }
    
    String jsonResponse;
    serializeJson(doc, jsonResponse);
    request->send(200, "application/json", jsonResponse);
  });
  
  Serial.println("Registering settings endpoints for recovery mode...");
  server.on("/settings", HTTP_GET, handleSettingsPage);
  server.on("/getSettings", HTTP_GET, handleGetSettings);
  server.on("/saveSettings", HTTP_POST, handleSaveSettings);
  server.on("/addNetwork",    HTTP_POST, handleAddNetwork);
  server.on("/removeNetwork", HTTP_POST, handleRemoveNetwork);
  Serial.println("Settings endpoints registered: /settings, /getSettings, /saveSettings");
  server.on("/getFiles", HTTP_GET, handleFileList);
  server.on("/download", HTTP_GET, handleFileDownload);
  server.on("/upload", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFileUpload);
  server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFirmwareUpload);
  server.on("/updatefs", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFilesystemUpload);
  server.on("/reboot", HTTP_GET, handleReboot);

  // Module identification endpoint (available in both normal and recovery mode)
  server.on("/version", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["name"] = NAME;
    doc["version"] = VERSION;
    String json;
    serializeJson(doc, json);
    request->send(200, "application/json", json);
  });

  // Start the recovery server
  logStartupState("Web Server", "Starting", "Recovery mode");
  server.begin();
  logStartupState("Recovery Mode", "Complete", "Web server started");
  Serial.println("Recovery Web Server started!");
  Serial.println("Connect to WiFi: " + recoverySSID);
  Serial.println("Password: " + String(recoveryPassword));
  Serial.println("Open browser to: http://192.168.4.1");
  Serial.println("=====================================");  
}

/**
 * @brief Executes normal system boot sequence with full hardware initialization
 * 
 * @details Normal boot mode performs complete system startup including:
 *          - Serial port configuration for GPS and IMU communication
 *          - I2C bus initialization and hardware component detection
 *          - Network configuration and WiFi connection establishment
 *          - Web server startup with full feature set
 *          - GPS module initialization and NTRIP client setup
 *          - Steering system calibration and motor driver configuration
 *          - LED indicators and switch interface setup
 * 
 *          This is the primary operational mode providing full system functionality.
 *          All hardware components are initialized and operational services started.
 * 
 * @note Only called when system passes configuration validation checks
 * @see recoveryBoot(), setup(), I2Csetup()
 */
void normalboot(){
  // Normal boot sequence
  /** @brief Normal boot sequence */
  Serial.println("Normal Boot Sequence Initiated");
  logStartupState("Normal Boot", "Started", "");
  
  LittleFS.begin(); // Ensure LittleFS is mounted
  espData.setState(2);
  logStartupState("Program State", "Set to 2", "");
  
  // Start other Serial Ports
  bnoSerial.setPins(espData.pins.BNO_PIN, 10);
  bnoSerial.begin(115200);
  String bnoDetails = "Pin: " + String(espData.pins.BNO_PIN) + ", 115200 baud";
  logStartupState("BNO Serial", "Initialized", bnoDetails.c_str());
  
  gpsSerial.setPins(espData.pins.GPS_RX, espData.pins.GPS_TX);
  gpsSerial.begin(460800);
  String gpsDetails = "RX: " + String(espData.pins.GPS_RX) + ", TX: " + String(espData.pins.GPS_TX) + ", 460800 baud";
  logStartupState("GPS Serial", "Initialized", gpsDetails.c_str());
  
  // Initialize I2C Manager for centralized bus management
  I2Csetup();
  if (i2cManager.begin(&twoWire, espData.i2c.MCP_ADDRESS, espData.i2c.ADS_ADDRESS)) {
    Serial.println("I2CManager initialized successfully");
    String i2cDetails = "MCP: 0x" + String(espData.i2c.MCP_ADDRESS, HEX) + ", ADS: 0x" + String(espData.i2c.ADS_ADDRESS, HEX);
    logStartupState("I2C Manager", "Initialized Successfully", i2cDetails.c_str());
    // Set optimal ADS settings for reduced I2C load
    // i2cManager.adsSetGain(GAIN_TWOTHIRDS);  // +/- 6.144V range
  } else {
    Serial.println("I2CManager initialization failed");
    logStartupState("I2C Manager", "Failed - Restarting", "");
    ESP.restart();
  }
  
  
  // Start GPS
  // Using MCPManager singleton approach (auto-detected when no MCP pointer provided):
 
    // If everything is good, turn on power to autosteer
  Serial.println("starting wifi");
  logStartupState("WiFi", "Starting Connection", "");
  
  espWifi.startAP();
  if (espData.wifiMode != 0 && espData.staCfg.count > 0) {
      espWifi.connectSTA();
  }
  espWifi.startMonitor();
  i2cManager.setEthLED(LEDPattern::ON);
  Serial.println("Wifi started. AP IP: " + WiFi.softAPIP().toString());
  logStartupState("WiFi", "Started", ("Mode: " + String(espData.wifiMode)).c_str());
  
  // START UDP SERVICES FIRST - before other components try to use them
  Serial.println("=== STARTING UDP SERVICES ===");
  logStartupState("UDP Services", "Starting", "Network ready");
  espUdp.begin(&gps);  // Initialize UDP services first
  logStartupState("UDP Services", "Complete", "Initialization successful");
  Serial.println("=== UDP SERVICES COMPLETE ===");
  
  // Now start other components that depend on UDP
  Serial.println("Starting hardware tasks...");
  logStartupState("MainPower", "Starting", "Task initialization");
  mainPower.startTask();

  Serial.println("Initializing GPS...");
  logStartupState("GPS", "Starting", "Initialization with UDP");
  gps.init(&espUdp);  // Now UDP is ready
  logStartupState("GPS", "Complete", "Initialization successful");
  
  Serial.println("Initializing steering...");
  logStartupState("Steering", "Starting", "System initialization");
  espSteer.begin(&espUdp);  // Now UDP is ready
  logStartupState("Steering", "Complete", "System ready");
  
  
  // UDP setup
  Serial.println("Network setup complete");
  // delay(5000);
  
